{
  "backend/main.mo": "Main Motoko actor defining logo animation data structures (2D/3D keyframes, effects, rotation configs) with CRUD operations for LogoData storage using a Map, including methods to add, retrieve, update, and filter logos by various criteria.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for integrating Google Gemini and OpenAI ChatGPT APIs into the PromptLogoGenerator component and useAILogoGeneration hook, replacing placeholder SVG generation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing a 3D logo animation app with fixed viewport, collapsible controls, 2D/3D workflow modes, timeline playback, camera animation, scene elements, audio management, and Canva-inspired styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme CSS variables for background, foreground, primary, secondary, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the logo.3dai application.",
  "frontend/src/App.tsx": "Main React application component managing workflow steps (workflow-select, upload, preview, export), 2D/3D mode switching, logo upload, animation settings, keyframes, timeline playback, audio management, camera animation, and scene elements with collapsible control panels.",
  "frontend/src/components/AnimationControls.tsx": "3D animation controls component with tabbed interface for transform (position X/Y/Z with sliders and numeric inputs), rotation axis configuration, and appearance settings, updating AnimationSettings via props.",
  "frontend/src/components/AnimationControls2D.tsx": "React component providing 2D animation controls for logo position (X, Y), scale, and opacity using sliders and numeric inputs. Renders cards with gradient headers and icons for each control category.",
  "frontend/src/components/AppLayout.tsx": "Main application layout component with header, footer, and background styling. Includes branding for 'logo.3dai' and a footer link to caffeine.ai with UTM tracking.",
  "frontend/src/components/AudioUploader.tsx": "Audio file upload component with drag-and-drop support, upload progress tracking, and audio preview playback controls. Accepts MP3/WAV files up to 20MB and displays metadata after upload.",
  "frontend/src/components/AutoEffectButton.tsx": "Component providing automated animation effect generation with toggle between rule-based and AI-powered modes (OpenAI/Google). Analyzes logo images and generates animation settings based on workflow mode.",
  "frontend/src/components/CameraControls.tsx": "Camera animation control panel with manual recording start/stop, keyframe management, and preset application. Includes configurable preset options for radius, speed, and rotation direction.",
  "frontend/src/components/CameraKeyframeEditor.tsx": "Editor component for individual camera keyframes allowing adjustment of position (X, Y, Z), rotation (in degrees), FOV, and timing. Provides numeric inputs for precise control of camera animation parameters.",
  "frontend/src/components/CollapsibleControlPanel.tsx": "A reusable collapsible card component with a toggle button that shows/hides child content with animation. Uses lucide-react icons and shadcn/ui Card components.",
  "frontend/src/components/EffectAnalysisPanel.tsx": "Panel for analyzing animations and generating recommendations using either rule-based logic or AI providers (OpenAI/Google). Allows selecting and applying multiple recommendations to animation settings with toast notifications.",
  "frontend/src/components/EffectsControls.tsx": "Control panel for visual effects including glow/bloom intensity, particle trails, and shadow intensity. Provides switches and sliders to adjust animation effect settings.",
  "frontend/src/components/ElementControls.tsx": "Properties panel for editing selected 3D scene elements with tabs for transform (position, scale, rotation) and appearance settings. Uses sliders and inputs for precise control.",
  "frontend/src/components/ElementInserter.tsx": "Panel for adding 3D shapes (cube, sphere, cylinder, plane) to the scene and managing a list of added elements. Supports element selection and removal with visual feedback.",
  "frontend/src/components/ExportControls.tsx": "Video export configuration panel with settings for duration, resolution, and frame rate. Handles video export with progress tracking and includes audio/sound effects if available.",
  "frontend/src/components/KeyframeEditor.tsx": "Editor for individual animation keyframes showing timestamp and allowing modification of keyframe settings. Includes delete functionality and wraps AnimationControls component.",
  "frontend/src/components/LogoModel3D.tsx": "React Three Fiber component that renders a 3D logo mesh with configurable material properties (opacity, glow, color tint), rotation animation, and geometry that switches between plane and box based on workflow mode (2D/3D).",
  "frontend/src/components/LogoUploader.tsx": "Component with tabbed interface for uploading logos via drag-and-drop/file picker or generating them with AI, displaying upload progress and preview, and passing the resulting image URL to parent component.",
  "frontend/src/components/MusicLibrary.tsx": "Card component displaying a list of background music tracks with play/pause preview controls and selection state, allowing users to choose audio for their animation.",
  "frontend/src/components/Preview3D.tsx": "React Three Fiber canvas wrapper that renders the 3D preview scene with logo, scene elements, camera controls, lighting, and optional camera path visualization with keyframe capture functionality.",
  "frontend/src/components/PromptLogoGenerator.tsx": "Form component for AI logo generation with text prompt input and provider selection (OpenAI/Google), displaying generation status, errors, and preview of generated logos.",
  "frontend/src/components/SceneElement3D.tsx": "Three.js mesh component that renders individual 3D scene elements (cube, sphere, cylinder, plane) with configurable geometry, material properties (metallic, glass, matte), position, scale, and rotation.",
  "frontend/src/components/SoundEffectsPanel.tsx": "Card component with toggle switches for enabling/disabling sound effects tied to animation events (rotation, scale changes, particle effects).",
  "frontend/src/components/Timeline.tsx": "Timeline component for animation playback control with keyframe management, displaying both animation and camera keyframes on a seekable track with play/pause/reset controls and buttons to add new keyframes.",
  "frontend/src/components/WorkflowSelector.tsx": "Workflow selection screen component that presents two cards (2D and 3D animation modes) with descriptions and feature lists, allowing users to choose their animation style at the start.",
  "frontend/src/hooks/useActor.ts": "Hook for managing the Internet Computer backend actor with authentication support, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAIAnimationRecommendations.ts": "Hook for generating AI-powered animation recommendations based on logo analysis and workflow mode, currently using placeholder rule-based logic pending backend AI integration with OpenAI/Google providers.",
  "frontend/src/hooks/useAILogoGeneration.ts": "Hook for generating logos using AI services (OpenAI or Google) from text prompts, managing generation state, errors, and the resulting logo URL.",
  "frontend/src/hooks/useAnimationSettings.ts": "TypeScript definitions for animation settings including keyframes, rotation, position, appearance, visual effects, and render mode (2D/3D), with default settings exported.",
  "frontend/src/hooks/useAudioManager.ts": "Hook for managing audio state including music track selection, custom audio uploads, sound effect toggles, and audio preview playback with play/stop controls.",
  "frontend/src/hooks/useAudioUpload.ts": "Hook for uploading audio files (MP3/WAV) with validation, progress tracking, metadata extraction (duration, size), and object URL management for audio preview.",
  "frontend/src/hooks/useCameraAnimation.ts": "Manages camera animation keyframes with recording, playback, and interpolation using cubic easing. Provides CRUD operations for keyframes and calculates interpolated camera states (position, rotation, FOV) at any given time.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP. Manages login state, identity persistence, and provides login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useLogoUpload.ts": "Handles logo file uploads with validation (PNG/JPG/SVG, max 10MB), progress tracking, and preview URL generation. Returns upload state and error handling.",
  "frontend/src/hooks/usePromptGeneration.ts": "Manages AI logo generation from text prompts with placeholder SVG generation. Tracks generation state, errors, and provides reset functionality for the generation workflow.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook using React Query for future backend data fetching. Currently returns null but structured to integrate with actor-based backend queries.",
  "frontend/src/hooks/useSceneElements.ts": "Manages 3D scene elements (cube, sphere, cylinder, plane) with properties like position, scale, rotation, color, and material. Provides CRUD operations and selection state.",
  "frontend/src/hooks/useTimelinePlayback.ts": "Controls animation timeline playback with play/pause/seek/reset functionality. Uses requestAnimationFrame for smooth playback and interpolates animation settings based on current time.",
  "frontend/src/hooks/useVideoExport.ts": "Handles video export with frame-by-frame rendering simulation, audio mixing, sound effect triggers, and progress tracking. Supports configurable resolution, frame rate, and camera animation.",
  "frontend/src/index.css": "Tailwind CSS configuration with Canva-inspired design system using OKLCH color space. Defines coral, purple, and teal color schemes with custom utilities for shadows and gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/utils/aiLogoService.ts": "Provides functions to generate logos using OpenAI DALL-E 3 and Google Gemini Imagen APIs, with prompt enhancement and error handling for both services.",
  "frontend/src/utils/audioMixing.ts": "Calculates sound effect triggers based on animation keyframes and provides placeholder functionality for mixing background music with sound effects for export.",
  "frontend/src/utils/cameraInterpolation.ts": "Provides easing functions and interpolation utilities for smooth camera position, rotation (using quaternion slerp), and FOV transitions.",
  "frontend/src/utils/cameraPresets.ts": "Generates predefined camera animation keyframe sequences including orbit, dolly zoom, fly-through, and tracking shot presets with configurable parameters.",
  "frontend/src/utils/effectAnalysis.ts": "Analyzes animation settings and provides intelligent effect recommendations tailored for 2D (no rotation) or 3D workflows based on logo analysis and scene elements.",
  "frontend/src/utils/effectGeneration.ts": "Generates complete animation profiles with keyframes based on logo analysis, creating 2D profiles without rotation and 3D profiles with full rotation capabilities.",
  "frontend/src/utils/frameCapture.ts": "Captures single or multiple frames from a canvas element as Blobs with progress tracking, and includes a placeholder for video encoding functionality.",
  "frontend/src/utils/interpolation.ts": "Provides interpolation functions for animation settings between keyframes, including linear interpolation for numeric values and color blending for hex colors.",
  "frontend/src/utils/logoAnalysis.ts": "Analyzes uploaded logo images using canvas pixel data to extract characteristics like dimensions, dominant colors, complexity, brightness, and colorfulness.",
  "frontend/src/utils/recommendationApplicator.ts": "Applies effect recommendations to animation settings by merging recommendation changes into current settings, supporting single or multiple recommendations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended utilities, and design tokens for the application theme.",
  "project_state.json": "Project metadata tracking architectural decisions, known issues, and existing features for an AI-powered logo-to-3D-video conversion application with dual 2D/3D workflows."
}